# taps
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'neovim/neovim'
tap 'homebrew/php'
tap 'heroku/brew'

# base
brew 'mas'
brew 'stow'
brew 'git'
brew 'git-flow'
brew 'git-ftp'
brew 'hub'
brew 'ag'
brew 'wget'
brew 'watchman'
brew 'zsh'
brew 'tmux'
brew 'python'
brew 'ruby'
brew 'kerl'
brew 'python3'
brew 'coreutils'
brew 'gpg'
brew 'automake'
brew 'autoconf'
brew 'openssl'
brew 'libyaml'
brew 'readline'
brew 'libxslt'
brew 'libtool'
brew 'unixodbc'
brew 'postgresql'
brew 'zplug'
brew 'source-highlight'
brew 'go', args: ['cross-compile-common']
brew 'lua', args: ['universal', 'with-completion']
brew 'luajit', args: ['with-52compat']
brew 'vim', args: ['override-system-vi', 'with-lua', 'with-luajit', 'with-tcl']
brew 'ruby'
brew 'rbenv'
brew 'reattach-to-user-namespace', args: ['with-wrap-pbcopy-and-pbpaste']
brew 'fzf', args: ['HEAD']
brew 'neovim', args: ['HEAD']

# utilities
brew 'awscli'
brew 'ansible'
brew 'mailhog'
brew 'watch'
brew 'tree'
brew 'ncdu'
brew 'htop'
brew 'ranger'
brew 'jq'
brew 'httpie'
brew 'w3m'
brew 'shellcheck'
brew 'heroku'
brew 'fpp'
brew 'ctags'
brew 'weechat', args: ['with-aspell', 'with-curl', 'with-lua', 'with-perl', 'with-python', 'with-ruby']

# dependencies
brew 'atool'
brew 'mediainfo'
brew 'highlight'
brew 'gcc'
brew 'ant'
brew 'gradle'
brew 'curl', args: ['with-ssl', 'with-libssh2']
brew 'composer'
brew 'imagemagick', args: ['with-webp']
brew 'graphicsmagick', args: ['with-webp']
brew 'ffmpeg', args: ['with-faac', 'with-fdk-aac', 'with-openssl', 'with-tools', 'with-webp']
brew 'aspell', args: ['with-lang-es', 'with-lang-en']
brew 'pandoc'

# casks
cask 'alfred'
cask 'android-sdk'
cask '1password-beta'
cask 'iterm2-nightly'
cask 'safari-technology-preview'
cask 'hammerspoon'
cask 'dropbox'
cask 'appcleaner'
cask 'imageoptim'
cask 'imagealpha'
cask 'paw'
cask 'psequel'
cask 'kaleidoscope'
cask 'sourcetree'
cask 'transmission'
cask 'licecap'
cask 'vlc'
cask 'bartender'
cask 'firefox'
cask 'firefoxdeveloperedition'
cask 'google-chrome'
cask 'google-chrome-beta'
cask 'google-chrome-canary'
cask 'onyx'
cask 'karabiner-elements'
cask 'java'
cask 'xquartz-beta'
cask 'skype'
cask 'dash'
cask 'xscope'
cask 'monolingual'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vagrant'
cask 'basictex'
cask 'tex-live-utility'
cask 'airfoil'
cask 'keycastr'

# quicklook
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'betterzipql'

# mac app store
mas 'Xcode', id: 497799835
mas 'xScope 4', id: 889428659
mas 'Sim Daltonism', id: 693112260
mas 'The Unarchiver', id: 425424353
mas 'Slack', id: 803453959
