# taps
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'heroku/brew'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'neovim/neovim'
tap 'caskroom/fonts'
tap 'Schniz/tap'
tap 'universal-ctags/universal-ctags'
tap 'hashicorp/tap'

# env
brew 'mas'
brew 'stow'

# basics
brew 'ag'
brew 'fpp'
brew 'fzf', args: ['HEAD']
brew 'git'
brew 'git-flow'
brew 'gpg'
brew 'htop'
brew 'httpie'
brew 'jq'
brew 'ncdu'
brew 'ranger'
brew 'tmux'
brew 'tree'
brew 'w3m'
brew 'watch'
brew 'wget'
brew 'zsh'
brew 'inetutils'
brew 'bat'
brew 'fd'
brew 'ripgrep'
brew 'git-delta'
brew 'jesseduffield/lazygit/lazygit'

# development
brew 'gh'
brew 'deno'
brew 'usbmuxd', args: ['HEAD']
brew 'libimobiledevice', args: ['HEAD']
brew 'ios-webkit-debug-proxy', args: ['HEAD']
brew 'mailhog'
brew 'neovim', args: ['HEAD']
brew 'vim', args: ['override-system-vi', 'with-lua', 'with-luajit', 'with-tcl']
brew 'ninja'

# deployments
brew 'ansible'
brew 'awscli'
cask 'google-cloud-sdk'
brew 'heroku'
brew 'jmeter'
brew 'kubectx', args: ['with-short-names']
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'terraform'
brew 'terraform-ls'
brew 'packer'

# languages
brew 'languagetool' # grammar
brew 'tectonic'     # latex
brew 'gcc'
brew 'glide'        # golang
brew 'go'
cask 'java'
brew 'gradle'       # java
brew 'kerl'
brew 'lua', args: ['universal', 'with-completion']
brew 'luajit', args: ['with-52compat']
brew 'python'
brew 'python3'
brew 'ruby'
brew 'rbenv'
brew 'ruby-build'

# dependencies
brew 'openssl'
brew 'aspell', args: ['with-lang-es', 'with-lang-en']
brew 'atool'
brew 'universal-ctags', args: ['HEAD']
brew 'curl', args: ['with-ssl', 'with-libssh2']
brew 'ffmpeg', args: ['with-faac', 'with-fdk-aac', 'with-openssl', 'with-tools', 'with-webp']
brew 'graphicsmagick', args: ['with-webp']
brew 'highlight'
brew 'imagemagick', args: ['with-webp']
brew 'ghostscript'
brew 'mediainfo'
brew 'pandoc'
brew 'reattach-to-user-namespace', args: ['with-wrap-pbcopy-and-pbpaste']
brew 'shellcheck'
brew 'source-highlight'
brew 'watchman'
brew 'graphviz'

# casks
cask '1password-beta'
cask 'airfoil'
cask 'alfred'
cask 'android-studio'
cask 'appcleaner'
cask 'bartender'
cask 'poedit'
cask 'basictex'
cask 'dash'
cask 'dropbox'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'google-chrome'
#cask 'google-chrome-beta'
cask 'google-chrome-canary'
cask 'hammerspoon'
cask 'imagealpha'
cask 'imageoptim'
cask 'iterm2'
cask 'kaleidoscope'
cask 'karabiner-elements'
cask 'keycastr'
cask 'licecap'
cask 'monolingual'
cask 'onyx'
cask 'paw'
cask 'psequel'
cask 'safari-technology-preview'
cask 'sequel-pro'
cask 'skype'
cask 'sourcetree'
cask 'keybase'
cask 'gpg-suite'
cask 'tex-live-utility'
cask 'transmission'
cask 'soda-player'
cask 'gitup'
cask 'skim'
#cask 'vagrant'
#cask 'virtualbox'
#cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'xquartz'
cask 'font-hasklig'
cask 'font-inconsolata'
cask 'font-hack-nerd-font'
cask 'font-source-code-pro'

# quicklook
#cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'webpquicklook'

# mac app store
mas "Ka-Block!", id: 1335413823
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Sim Daltonism", id: 693112260
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "xScope", id: 889428659
